app/controllers/home_controller.rb

  def income
    @income = Income.new(params[:income])
    if request.post?
      @last_balance_record = BalanceBook.all
      @income.created_at = params[:created_at]
      if @income.save
        @balance_book = BalanceBook.new
        @balance_book.income_id = @income.id
        @balance_book.credit_amount = @income.amount
        if @last_balance_record.size == 0
          @balance_book.balance_amount = @income.amount
        else
          @balance_book.balance_amount = @last_balance_record.last.balance_amount + @income.amount
        end
        if @balance_book.save
          redirect_to root_path
        end
      end
    end
    @all_income = Income.all
---
SELECT * FROM `balance_books` ORDER BY balance_books.id DESC LIMIT 1
INSERT INTO `incomes` (`created_at`, `updated_at`, `amount`, `description`, `particular`) VALUES('2010-11-25 09:34:13', '2010-11-25 09:34:13', 500, '', 'F.D. Interest')
INSERT INTO `balance_books` (`debit_amount`, `created_at`, `updated_at`, `expense_id`, `balance_amount`, `income_id`, `credit_amount`) VALUES(NULL, '2010-11-26 05:41:56', '2010-11-26 05:41:56', NULL, 500, 1, 500)
SELECT * FROM `incomes`

  def expense
    @expense = Expense.new(params[:expense])
    if request.post?
      if @expense.save
        @expense.created_at = params[:created_at]
        @last_book_record = BalanceBook.all
        @balance_book = BalanceBook.new
        @balance_book.expense_id = @expense.id
        @balance_book.debit_amount = @expense.amount
        @balance_book.balance_amount = @last_book_record.last.balance_amount - @expense.amount
        if @balance_book.save
          redirect_to root_path
        end

      end
    end
    @all_expense = Expense.all
---
INSERT INTO `expenses` (`created_at`, `updated_at`, `amount`, `description`, `particular`) VALUES('2010-11-25 09:39:48', '2010-11-25 09:39:48', 125, '', 'Bill No. 167')
SELECT * FROM `balance_books`
INSERT INTO `balance_books` (`debit_amount`, `created_at`, `updated_at`, `expense_id`, `balance_amount`, `income_id`, `credit_amount`) VALUES(1500, '2010-11-26 06:04:44', '2010-11-26 06:04:44', 2, -1000, NULL, NULL)
SELECT * FROM `expenses`

  def view_balance_book
    @all_records = BalanceBook.all
---
SELECT * FROM `balance_books`