app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '3015aaa05771225bba64dd5be49cf455ee1855c7', '2010-11-25 06:36:20', 'f660452e2ab6cc891dfb9d6ad96c518f51d74e5c', NULL, '2010-11-25 06:36:20', NULL, 'parth', 'ya@yo.com')